Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/svd/WBZ450.svd
            <register>
               <name>ADCDMABCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x334</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMABSET</name>
               <description>Bit set register</description>
               <addressOffset>0x338</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMABINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x33c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCTRGSNSCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x344</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCTRGSNSSET</name>
               <description>Bit set register</description>
               <addressOffset>0x348</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCTRGSNSINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x34c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADC0TIMECLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x354</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADC0TIMESET</name>
               <description>Bit set register</description>
               <addressOffset>0x358</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADC0TIMEINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x35c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCEISTAT1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x3e4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCEISTAT1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x3e8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCEISTAT1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x3ec</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCANLCTLCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x404</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCANLCTLSET</name>
               <description>Bit set register</description>
               <addressOffset>0x408</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCANLCTLINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x40c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFGSHRCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x674</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFGSHRSET</name>
               <description>Bit set register</description>
               <addressOffset>0x678</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFGSHRINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x67c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSVCONCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x684</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSVCONSET</name>
               <description>Bit set register</description>
               <addressOffset>0x688</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSVCONINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x68c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSYSCFG0CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x704</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSYSCFG0SET</name>
               <description>Bit set register</description>
               <addressOffset>0x708</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSYSCFG0INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x70c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
